/*======================================================================
	プロジェクト名	：C言語プログラミング
	ファイル名		：myself.c
	機能			：自身の生年から年齢を算出する
	修正履歴		：2018/4/26 小俣大河
======================================================================*/

/*======================================================================
	出力結果：
	my name is 小俣大河.
	I was born in 1995. So, my age is 23.
	
	自身の生年と現在の年をサンプルファイルに代わりに入れた。
	結果、自身の年齢が算出された。
======================================================================*/

#define	MYNAME	"小俣大河"
#define THISYEAR 2018


int myage( int bornyear)
{
	return ( THISYEAR - bornyear );
}

char *myname( void )
{
	return ( MYNAME );
}

