/*======================================================================
  プロジェクト名：C言語基礎
  ファイル名	：rensyu_09.c
  機能			：比較演算子の確認
  Copyright(c) 2015 - 2018 emBex Education inc. All Rights Reserved.
======================================================================*/
/* ヘッダファイル読み込み */
#include	<stdio.h>

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：なし
	戻り値			：終了情報（常に0）
	特記事項		：なし
======================================================================*/
int main(void)
{
	/* 変数定義 */
	int		i1,i2;		/* ユーザ入力 */

	/* ユーザ入力 */
	printf("i1を入力してください >");
	scanf("%d", &i1);
	printf("i2を入力してください >");
	scanf("%d", &i2);

	/* 比較演算結果出力 */
	printf("%d >  %d ⇒ %d\n", i1, i2, i1 >  i2);
	printf("%d <  %d ⇒ %d\n", i1, i2, i1 <  i2);
	printf("%d >= %d ⇒ %d\n", i1, i2, i1 >= i2);
	printf("%d <= %d ⇒ %d\n", i1, i2, i1 <= i2);
	printf("%d == %d ⇒ %d\n", i1, i2, i1 == i2);
	printf("%d != %d ⇒ %d\n", i1, i2, i1 != i2);
	
	/* 結果return */
	return 0;
}
