/*======================================================================
  プロジェクト名：C言語基礎
  ファイル名	：rensyu_01.c
  機能			：ある範囲の連続した数値を偶数のみ合計します。
  Copyright(c) 2015 - 2018  emBex Education inc. All Rights Reserved.
======================================================================*/
/* ヘッダファイル読み込み */
#include	<stdio.h>

/* 定数定義 */
#define	NUM_INIT	11
#define	LOOP_MAX	20

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：なし
	戻り値			：終了情報（常に0）
	特記事項		：なし
======================================================================*/
int main(void)
{       /*↑このvoidは省略可能です。 */

	/* 変数定義 */
	int ans; /* 総和 */
	int num; /* 数値 */
	
	/* 初期値代入 */
	ans = 0;
	num = NUM_INIT;

	/* 数値加算 */
	while (num <= LOOP_MAX) {	/*LOOP_MAXまで繰り返す */
		if (num % 2 == 0) {		/*numを２で割った余りが０か？ */
				ans = ans + num ;/*ansにnumを加算したものをansに格納 */
		}
		num = num + 1;/*numのインクリメント */
	}

	/* 結果表示 */
	printf("%d～%dの偶数の合計は%dです",NUM_INIT,LOOP_MAX,ans);

END:
	/* 終了 */
	return 0;
}
