/*======================================================================
  プロジェクト名：C言語基礎
  ファイル名	：rensyu_10.c
  機能			：if -else-
  Copyright(c) 2015 - 2018 emBex Education inc. All Rights Reserved.
======================================================================*/
/* ヘッダファイル読み込み */
#include	<stdio.h>

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：なし
	戻り値			：終了情報（常に0）
	特記事項		：なし
======================================================================*/
int main(void)
{
	/* 変数定義 */
	int		in;			/* ユーザ入力データ */
	
	/* ユーザ入力 */
	printf("100以上の整数を入力してください >");
	scanf("%d", &in);
	
	/* 結果出力 */
	if (in >= 100){
		printf("true\n");
	} else {
		printf("false\n");
	}
	
	return 0;
}
