/*======================================================================
  プロジェクト名：C言語基礎
  ファイル名	：rensyu_11.c
  機能			：if -else if-
  Copyright(c) 2015 - 2018 emBex Education inc. All Rights Reserved.
======================================================================*/
/* ヘッダファイル読み込み */
#include	<stdio.h>

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：なし
	戻り値			：終了情報（常に0）
	特記事項		：なし
======================================================================*/
int main(void)
{
	/* 変数定義 */
	int		in;			/* ユーザ入力データ */
	
	/* ユーザ入力 */
	printf("何階に行きますか？（１～３）>");
	scanf("%d", &in);
	
	/* 1階：化粧品売り場
	   2階：紳士服売り場
	   3階：婦人服売り場 */
	
	/* 入力データ判定と結果表示 */
	if (in == 1) {
		printf("化粧品売り場です\n");
	} else if (in == 2) {
		printf("紳士服売り場です\n");
	} else if (in == 3) {
		printf("婦人服売り場です\n");
	} else {
		printf("その階には行けません\n");
	}
	
	return 0;
}
