/*======================================================================
  プロジェクト名：C言語基礎
  ファイル名	：rensyu_18.c
  機能			：標準ライブラリ関数
  Copyright(c) 2015 - 2018 emBex Education inc. All Rights Reserved.
======================================================================*/
/* ヘッダファイル読み込み */
#include	<stdio.h>

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：なし
	戻り値			：終了情報（常に0）
	特記事項		：なし
======================================================================*/
int main(void)
{
	/* 変数定義 */
	char	in[64];		/* ユーザ入力データ */
	int		len;		/* 文字列長 */
	
	/* ユーザ入力 */
	printf("文字列を入力してください >");
	scanf("%s", in);
	
	/* ユーザ入力表示と文字列長取得 */
	printf("入力した文字列：");
	len = printf("%s", in);
	printf("\n");
	
	/* 文字列長表示 */
	printf("入力した文字列の長さ：%d\n", len);
	
	return 0;
}
