/*======================================================================
  プロジェクト名：C言語基礎
  ファイル名	：rensyu_15.c
  機能			：for
  Copyright(c) 2015 - 2018 emBex Education inc. All Rights Reserved.
======================================================================*/
/* ヘッダファイル読み込み */
#include	<stdio.h>

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：なし
	戻り値			：終了情報（常に0）
	特記事項		：なし
======================================================================*/
int main(void)
{
	/* 変数定義 */
	int		in[5];		/* ユーザ入力データ */
	int		i;			/* ループ用変数 */
	
	/* ユーザ入力 */
	for (i = 0; i < 5; i++) {
		printf("第 %d の要素 >",i);
		scanf("%d", &in[i]);
	}
	
	/* 表示 */
	printf("入力された値は ");
	for (i = 0; i < 5; i++) {
		if(i == 4) {
			printf("%d", in[i]);
		}
		else {
			printf("%d,", in[i]);
		}
	}
	printf(" です。\n");
	
	return 0;
}
