/*======================================================================
  プロジェクト名：C言語基礎
  ファイル名	：rensyu_14.c
  機能			：do while
  Copyright(c) 2015 - 2018 emBex Education inc. All Rights Reserved.
======================================================================*/
/* ヘッダファイル読み込み */
#include	<stdio.h>

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：なし
	戻り値			：終了情報（常に0）
	特記事項		：なし
======================================================================*/
int main(void)
{
	/* 変数定義 */
	int		in;			/* ユーザ入力データ */
	int		loop;		/* ループ可否 */
	
	/* 変数初期化 */
	loop = 1;
	
	/* ループ */
	do {
		/* ユーザ入力 */
		printf("何階に行きますか？（１～３）>");
		scanf("%d", &in);
		
		/* 入力判定と結果表示 */
		switch (in) {
		case 1:
			printf("化粧品売り場です\n");
			break;
		case 2:
			printf("紳士服売り場です\n");
			break;
		case 3:
			printf("婦人服売り場です\n");
			break;
		default:
			printf("その階には行けません\n");
			loop = 0;
			break;
		}
	} while (loop);
	
	return 0;
}
