/*======================================================================
  プロジェクト名：C言語基礎
  ファイル名	：rensyu_21.c
  機能			：ポインタ
  Copyright(c) 2015 - 2018 emBex Education inc. All Rights Reserved.
======================================================================*/
/* ヘッダファイル読み込み */
#include	<stdio.h>

/* 定数定義 */
#define		NUM_ARR	5

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：なし
	戻り値			：終了情報（常に0）
	特記事項		：なし
======================================================================*/
int main(void)
{
	/* 変数定義 */
	int		arr[NUM_ARR];	/* ユーザ入力データ */
	int		i;				/* ループ用変数 */
	int		*p;				/* ポインタ変数 */
	
	/* ユーザ入力 */
	printf("int型の数値を%d個代入してください\n", NUM_ARR);
	for (i = 0; i < NUM_ARR; i++) {
		printf("要素%d >", i);
		scanf("%d", &arr[i]);
	}
	
	/* ポインタ変数へ代入 */
	p = &arr[0];
	
	/* 結果表示 */
	printf("入力した値は配列に格納されました！\n");
	printf("あなたの入力した整数は以下のとおりです。\n");
	for(i = 0; i < NUM_ARR; i++) {
		printf("要素%d:%d\n", i, *p);
		p++;	/* pをインクリメント */
	}
	
	return 0;
}
