/*======================================================================
  プロジェクト名：C言語基礎
  ファイル名	：rensyu_17.c
  機能			：ユーザ定義関数
  Copyright(c) 2015 - 2018 emBex Education inc. All Rights Reserved.
======================================================================*/
/* ヘッダファイル読み込み */
#include	<stdio.h>

/* 関数プロトタイプ宣言 */
int pow2(int src);

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：なし
	戻り値			：終了情報（常に0）
	特記事項		：なし
======================================================================*/
int main(void)
{
	/* 変数定義 */
	int		in;			/* ユーザ入力データ */
	
	/* ユーザ入力 */
	printf("数値を入力してください（-10000～10000）>");
	scanf("%d", &in);
	
	/* ユーザ定義関数呼び出しと結果表示 */
	printf("2乗した値：%d\n", pow2(in));
	
	return 0;
}

/*======================================================================
	関数名			：pow2
	機能			：入力引数の2乗を返す
	入力引数説明	：src = 整数型入力データ
	出力引数説明	：なし
	戻り値			：入力引数を2乗した値
	特記事項		：なし
======================================================================*/
int pow2(int src)
{
	return src * src;
}
