/*======================================================================
  プロジェクト名：C言語基礎
  ファイル名	：rensyu_07.c
  機能			：文字列
  Copyright(c) 2015 - 2018 emBex Education inc. All Rights Reserved.
======================================================================*/
/* ヘッダファイル読み込み */
#include <stdio.h>

/* 定数定義 */
#define MAX_STR	10

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：なし
	戻り値			：終了情報（常に0）
	特記事項		：なし
======================================================================*/
int main(void)
{
	/* 変数定義 */
	char	str[MAX_STR + 1] = {0};	/* ユーザ入力データ */
	int		i;						/* ループ用変数 */
	int		buf;					/* scanf受付用バッファ */

	/* ユーザ入力 */
	for (i = 0; i < MAX_STR; i++) {
		printf("%d文字目のASCIIコードを入力してください：", i);
		scanf("%d", &buf);
		str[i] = buf;
		/*str[i]=(char)buf; */
	}
	str[MAX_STR] = '\0';
	
	/* 入力結果表示 */
	printf("%s", str);

	/* 結果return */
	return 0;
}
