/*======================================================================
  プロジェクト名：C言語基礎
  ファイル名	：rensyu_20.c
  機能			：ポインタ
  Copyright(c) 2015 - 2018 emBex Education inc. All Rights Reserved.
======================================================================*/
/* ヘッダファイル読み込み */
#include	<stdio.h>

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：なし
	戻り値			：終了情報（常に0）
	特記事項		：なし
======================================================================*/
int main(void)
{
	/* 変数定義 */
	int		a;		/* データ */
	int		*p;		/* ポインタ変数 */
	
	/* データ代入 */
	a = 100;
	p = &a;		/* ポインタ変数への代入 */
	
	/* 結果表示 */
	printf("変数a：%d\n", *p);
	
	return 0;
}
