/*======================================================================
  プロジェクト名：C言語基礎
  ファイル名	：rensyu_03.c
  機能			：標準入出力関数の確認
  Copyright(c) 2015 - 2018 emBex Education inc. All Rights Reserved.
======================================================================*/
/* ヘッダファイル読み込み */
#include	<stdio.h>

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：なし
	戻り値			：終了情報（常に0）
	特記事項		：なし
======================================================================*/
int main(void)
{
	/* 変数定義 */
	int in;		/* ユーザ入力データ */

	/* ユーザ入力 */
	scanf("%d", &in);
	
	/* 表示 */
	printf("入力された数値は%dです。\n", in);
	
	/* 結果return */
	return 0;
}
