/*======================================================================
  プロジェクト名：C言語基礎
  ファイル名	：rensyu_04.c
  機能			：変数データの取り扱い
  Copyright(c) 2015 -2018 emBex Education inc. All Rights Reserved.
======================================================================*/
/* ヘッダファイル読み込み */
#include	<stdio.h>

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：なし
	戻り値			：終了情報（常に0）
	特記事項		：なし
======================================================================*/
int main(void)
{
	/* 変数定義 */
	char	moji;		/* 文字データ格納用変数 */

	/* 文字データ代入 */
	moji = 'G';

	/* 表示 */
	printf("mojiの値　　　　：%x\n", moji);
	printf("mojiの文字データ：%c\n", moji);

	/* 結果return */
	return 0;
}
