/*======================================================================
  プロジェクト名：C言語基礎
  ファイル名	：rensyu_08.c
  機能			：演算子の確認
  Copyright(c) 2015 - 2018 emBex Education inc. All Rights Reserved.
======================================================================*/
/* ヘッダファイル読み込み */
#include	<stdio.h>

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：なし
	戻り値			：終了情報（常に0）
	特記事項		：なし
======================================================================*/
int main(void)
{
	/* 変数定義 */
	int		i1, i2;	/* int型ユーザ入力 */
	double	d1, d2;	/* double型ユーザ入力 */

	/* ユーザ入力（整数） */
	printf("整数1を入力してください >");
	scanf("%d", &i1);
	printf("整数2を入力してください >");
	scanf("%d", &i2);

	/* 演算結果表示（整数） */
	printf("A + B ⇒ %d\n",  i1 + i2);
	printf("A - B ⇒ %d\n",  i1 - i2);
	printf("A * B ⇒ %d\n",  i1 * i2);
	printf("A / B ⇒ %d\n",  i1 / i2);
	printf("A %% B ⇒ %d\n", i1 % i2);

	/* ユーザ入力（実数） */
	printf("実数1を入力してください >");
	scanf("%lf", &d1);
	printf("実数2を入力してください >");
	scanf("%lf", &d2);

	/* 演算結果表示（実数） */
	printf("A + B ⇒ %f\n", d1 + d2);
	printf("A - B ⇒ %f\n", d1 - d2);
	printf("A * B ⇒ %f\n", d1 * d2);
	printf("A / B ⇒ %f\n", d1 / d2);

	/* 結果return */
	return 0;
}
