/*======================================================================
  プロジェクト名：C言語基礎
  ファイル名	：rensyu_22.c
  機能			：ポインタ
  Copyright(c) 2015 - 2018 emBex Education inc. All Rights Reserved.
======================================================================*/
/* ヘッダファイル読み込み */
#include	<stdio.h>

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：なし
	戻り値			：終了情報（常に0）
	特記事項		：なし
======================================================================*/
int main(void)
{
	/* 変数定義 */
	char	*str = "Hello World!";		/* 文字列 */
	int		in;							/* ユーザ入力 */
	
	/* 文字列出力 */
	printf("%s", str);
	printf("\n");
	
	/* ユーザ入力 */
	printf("要素の番号を指定してください(0-11) >");
	scanf("%d", &in);
	
	/* ポインタ変数への代入 */
	str = str + in;
	
	/* 結果出力 */
	printf("指定した文字：%c\n", *str);
	printf("ASCIIコード：%d\n",  *str);
	
	return 0;
}
