/*======================================================================
  プロジェクト名：C言語基礎
  ファイル名	：tsuika_11.c
  機能			：while文
  Copyright(c) 2015 - 2018 emBex Education inc. All Rights Reserved.
======================================================================*/
/* ヘッダファイル読み込み */
#include	<stdio.h>
#include	<string.h>

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：なし
	戻り値			：終了情報（常に0）
	特記事項		：なし
======================================================================*/
int main(void)
{
	/* 変数定義 */
	char	in[4] = {0};	/* ユーザ入力データ */
	int		loop;			/* ループ可否 */
	
	/* 1階：化粧品売り場
	   2階：紳士服売り場
	   3階：婦人服売り場 */

	/* 変数初期化 */
	loop = 1;
	
	/* ループ */
	while (loop) {
		/* ユーザ入力 */
		printf("何階に行きますか？（１～３）>");
		scanf("%s", in);
		
		/* ループ終了判定 */
		if (!strcmp(in, "exit")) {
			loop = 0;
		} else {
			/* 結果表示 */
			switch (in[0]) {
			case '1':
				printf("化粧品売り場です\n");
				break;
			case '2':
				printf("紳士服売り場です\n");
				break;
			case '3':
				printf("婦人服売り場です\n");
				break;
			default:
				printf("その階には行けません\n");
				break;
			}
		}
	}

	return 0;
}
