/*======================================================================
  プロジェクト名：C言語基礎
  ファイル名	：tsuika_13.c
  機能			：ポインタ
  Copyright(c) 2015 - 2018 emBex Education inc. All Rights Reserved.
======================================================================*/
/* ヘッダファイル読み込み */
#include	<stdio.h>

/* 関数プロトタイプ宣言 */
void BubbleSort(int arr[], int n);

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：なし
	戻り値			：終了情報（常に0）
	特記事項		：なし
======================================================================*/
int main(void)
{
	/* 変数定義 */
	int		arr[5];		/* ユーザ入力データ */
	int		i;			/* ループ用変数 */
	int		*p;			/* ポインタ変数 */
	
	/* ユーザ入力 */
	printf("int型の数値を５つ代入してください\n");
	for (i = 0; i < 5; i++) {
		printf("要素%d >", i);
		scanf("%d", &arr[i]);
	}
	
	/* ポインタ変数へ代入 */
	p = &arr[0];
	
	/* 結果表示 */
	printf("入力した値は配列に格納されました！\n");
	printf("あなたの入力した整数は以下のとおりです。\n");
	for(i = 0; i < 5; i++) {
		printf("要素%d:%d\n", i, *p);
		p++;	/* pをインクリメント */
	}
	
	/* ソート */
	BubbleSort(arr, 5);
	printf("昇順でソートしました。\n");
	
	/*結果表示  */
	p = &arr[0];	/* ポインタ変数へ代入 */
	for(i = 0; i < 5; i++) {
		printf("要素%d:%d\n", i, *p);
		p++;
	}
	
	return 0;
}

/*======================================================================
	関数名			：BubbleSort
	機能			：バブルソート
	入力引数説明	：int arr[] 要素配列
					  int n 要素数
	出力引数説明	：なし
	戻り値			：なし
	特記事項		：なし
======================================================================*/
void BubbleSort(int arr[], int n)
{
	/* 変数定義 */
	int		i;
	int		tmp;
	int		flag;
	
	/* ソート */
	do {
		flag = 0;
		for (i = 0; i < n - 1; i++) {
			if (arr[i] > arr[i+1]) {
				tmp = arr[i];
				arr[i] = arr[i + 1];
				arr[i + 1] = tmp;
				flag = 1;
			}
		}
	} while (flag == 1);
}
