/*======================================================================
  プロジェクト名：C言語基礎
  ファイル名	：tsuika_04.c
  機能			：変数データの取り扱い
  Copyright(c) 2015 - 2018 emBex Education inc. All Rights Reserved.
======================================================================*/
/* ヘッダファイル読み込み */
#include	<stdio.h>
#include	<string.h>

/* 定数定義 */
#define		LEN_STR	256	/* 文字列長 */

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：なし
	戻り値			：終了情報（常に0）
	特記事項		：なし
======================================================================*/
int main(void)
{
	/* 変数定義 */
	char	str[LEN_STR] = {0};		/* ユーザ入力データ */
	int		i;						/* ループ用変数 */
	
	/* ユーザ入力 */
	printf("文字列を入力してください：");
	scanf("%s", str);
	
	/* 結果表示 */
	i = 0;
	while(str[i]!='\0') {
		printf("入力(%d)の値　　　　：%x\n", i, str[i]);
		printf("入力(%d)の文字データ：%c\n", i, str[i]);
		i++;
	}
	
	/* 結果return */
	return 0;
}
