/*======================================================================
  プロジェクト名：C言語基礎
  ファイル名	：tsuika_01.c
  機能			：日付表示
  Copyright(c) 2015 emBex Education inc. All Rights Reserved.
======================================================================*/
/* ヘッダファイル読み込み */
#include	<stdio.h>

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：なし
	戻り値			：終了情報（常に0）
	特記事項		：なし
======================================================================*/
int main(void)
{
	/* 日付表示 */
	printf("今日は%d年%d月%d日です。\n", 2018, 4 , 4);

	/* 結果return */
	return 0;
}
