/*======================================================================
  プロジェクト名：C言語基礎
  ファイル名	：tsuika_17.c
  機能			：入力数字の１の位と１０の位を表示
  Copyright(c) 2015 - 2018 emBex Education inc. All Rights Reserved.
======================================================================*/
/* ヘッダファイル読み込み */
#include	<stdio.h>

/* 定数定義 */
#define		DIV	100

/*======================================================================
	関数名			：main
	機能			：メイン処理
	入力引数説明	：なし
	戻り値			：終了情報（常に0）
	特記事項		：なし
======================================================================*/
int main(void)
{
	/* 変数定義 */
	int		in;			/* 入力数字 */
	int		num110;

	/* ユーザ入力 */
	printf("数字を入力して下さい。>");
	scanf("%d", &in);

	num110 = in % DIV;		/*１０の位以下の数字を取り出す。 */
	if(num110 < 10){		/*１０の位が無い場合 */
		/* 問題の(例2の使用条件：１０未満は１０の位に０を表示する。) */
		printf("「%d」の１の位と１０の位は「0%d」\n",in,in%DIV);
	}else{	
		printf("「%d」の１の位と１０の位は「%d」\n",in,in%DIV);
	}

	return(0);
}
